app/controllers/logins_controller.rb

  def new
    email = request.headers['email']
    user = User.find_by(email: email)
---
SELECT  "users".* FROM "users" WHERE "users"."email" = $1 LIMIT $2  [["email", "userh@domain.com"], ["LIMIT", 1]]