app/controllers/statement_controller.rb

SELECT  "accounts".* FROM "accounts" WHERE "accounts"."id" = $1 LIMIT $2  [["id", 1], ["LIMIT", 1]]
SELECT "transaktions".* FROM "transaktions" WHERE "transaktions"."created_at" BETWEEN $1 AND $2 AND "transaktions"."account_id" = $3  [["created_at", "2019-04-25"], ["created_at", "2019-04-25"], ["account_id", 143]]
---
	def get_statement
		@recipient=current_user
		@account=Account.find(params[:account_id])
		@start_date=Date.parse(params[:start_date])
		@end_date=Date.parse(params[:end_date])
		# binding.pry
		@statement_transaktions=Transaktion.where(created_at: @start_date..@end_date, account_id: @account.id)