app/controllers/transactions_controller.rb

  def deposit
    agent = debit_account(type: 'agency')
    current_user.agency.deposit(transaction_params)
    render json: agent.transaktions.last, status: :ok
---
SELECT  "transaktions".* FROM "transaktions" WHERE "transaktions"."account_id" = $1 ORDER BY "transaktions"."id" DESC LIMIT $2  [["account_id", 127], ["LIMIT", 1]]