app/controllers/users_controller.rb

  def create
    @user = User.new(resource_params)

    if @user.save
---
INSERT INTO "users" ("email", "encrypted_password", "phone_number", "full_name", "created_at", "updated_at", "jti") VALUES ($1, $2, $3, $4, $5, $6, $7) RETURNING "id"